<?php header("Content-Type: text/html; charset=utf-8");?>
<?php


$a=[];
$a[1] = "Dima";
$a["45"]="Ann";
$a[]="Dann";
$a["z"]="Hello!!!";
$a[]="evolution";

$b=array(1=>12, 2=>22, 3=>array("a"=>"a-11", "b"=>"b-11"),4=>44 );
$c=$a+$b;
foreach($c as $key=>$value){
    echo $key . ' ' . $value ."<br>";
}?>
<h1>Проверка</h1>
<?php echo "<pre>"; var_export($c) ?><pre>




<?php if ($_REQUEST["num"]>0 && $_REQUEST["num"]<=28){?>

    В этот день, <?php echo $_REQUEST["num"]?> февраля 2015 года.<br>
    <?php switch ($_REQUEST["num"]) {
        case '1': ?> Заступает II-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<?php ; break;?>
        <?php case '2': ?>Заступает III-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области. <? ; break;?>
        <?php case "3": ?> Заступает IV-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области. <?php ; break; ?>
        <?php case "4": ?> Заступает I-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Всемирный день борьбы против рака. <?php ; break; ?>
        <?php case "5": ?> Заступает II-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области. <?php ; break; ?>
        <?php case "6": ?> Заступает III-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Международный день бармена.<?php ; break; ?>
        <?php case "7": ?> Заступает IV-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области. <?php ; break; ?>
        <?php case "8": ?> Заступает I-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области. <?php ; break; ?>
        <?php case "9": ?> Заступает II-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Международный день стоматолога.<?php ; break; ?>
        <?php case "10": ?> Заступает III-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            День безопасного интернета.<?php ; break; ?>
        <?php case "11": ?> Заступает IV-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Всемирный день больного.<?php ; break; ?>
        <?php case "12": ?> Заступает I-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области. <?php ; break; ?>
        <?php case "13": ?> Заступает II-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            <h3>День Рождения у Ларисы Викторовны !!!</h3><?php ; break; ?>
        <?php case "14": ?> Заступает III-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            День Святого Валентина. <?php ; break; ?>
        <?php case "15": ?> Заступает IV-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Международный день онкобольного ребенка.<br>
            День чествования участников боевых действий на территории других государств. <br>
            Сретение Господне. <?php ; break; ?>
        <?php case "16": ?> Заступает I-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Масленица. <?php ; break; ?>
        <?php case "17": ?> Заступает II-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Масленица.<br>
            День спонтанного проявления доброты. <?php ; break; ?>
        <?php case "18": ?> Заступает III-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Масленица. <?php ; break; ?>
        <?php case "19": ?> Заступает IV-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Масленица. <?php ; break; ?>
        <?php case "20": ?> Заступает I-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Масленица. <br>
            Всемирный день социальной справедливости. <?php ; break; ?>
        <?php case "21": ?> Заступает II-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Масленица. <br>
            Международный день родного языка. <?php ; break; ?>
        <?php case "22": ?> Заступает III-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Масленица. <br>
            Международный день поддержки жертв преступлений. <?php ; break; ?>
        <?php case "23": ?> Заступает IV-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            День защитника отечества.<br>
            Великий пост. <?php ; break; ?>
        <?php case "24": ?> Заступает I-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Великий пост. <?php ; break; ?>
        <?php case "25": ?> Заступает II-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Великий пост. <?php ; break; ?>
        <?php case "26": ?> Заступает III-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Великий пост.<br>
            <h3> День Рождения у Жеки!!!</h3><?php ; break; ?>
        <?php case "27": ?> Заступает IV-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Великий пост. <?php ; break; ?>
        <?php case "28": ?> Заступает I-смена караула оперативно-спасательной службы ГУ ГСЧС в Харьковской области.<br>
            Великий пост. <?php ; break; ?>
        <?php default:?> Такого числа не существует в феврале 2015 года. <?php ; break;?>
        <?php } ?>
<?php } else {?> Такого числа не существует в феврале 2015 года. <?php }?>